Repository: flok99/PowerBankControl
Catalog: *.po
Languages: nl

source: %s is an unknown mode
nl: %s is niet bekend

source: (virtual in case of USB -)serial device to which the powerbank is connected
nl: seriele port waaraan de powerbank verbonden is

source: - dec-hv: decrease HV voltage (in 64 steps)
nl: - dec-hv: verlaag het HV voltage (in 64 stappen)

source: - dump: dump configuration & state of power bank
nl: - dump: dump de configuratie en de toestand van de power bank

source: - graph: draw a graph (on the terminal) in realtime of all measurements. use -p to set an interval in ms.
nl: - graph: teken een grafiek (op de terminal) van alle voltages/stromen.gebruik -o om een interval (in ms) te configureren.

source: - hv output voltage, # usb output current
nl: - hv voltage, # usb stroom

source: - inc-hv: increase HV voltage (in 64 steps)
nl: - inc-hv: verhoog HV voltage (in 64 stappen)

source: - set-bq24295: configure charger chip, see data-sheet at http://www.ti.com/lit/ds/symlink/bq24295.pdf
nl: - set-bq24295: configureer oplaad chip, zie data-sheet op http://www.ti.com/lit/ds/symlink/bq24295.pdf

source: - set-hv: toggle state of HV power (-p: on/off)
nl: - set-hv: schakel status van HV power (-p: on (=aan)/off (=uit))

source: - set-name: configure name of bank
nl: - set-name: configureer de naam van het apparaat

source: - set-usb: toggle state of USB power (-p: on/off)
nl: - set-usb: schakel status van USB power (-p: on (=aan)/off (=uit))

source: - ups: shutdown system when power is off for a while (-D) using a user selected command (-s)
nl: -ups: zet het systeem uit als de oplaad aansluiting even (-D) niet is aangesloten en doe dat met het commando dat -S specificeert

source: BQ24295 registers:
nl: BQ24295 instellingen:

source: Battery overvoltage!!
nl: Batterij heeft te hoog voltage!!

source: Battery too cold!
nl: Batterij te koud!

source: Battery too hot!!!
nl: Batterij te warm!!!

source: Battery uptime: %u
nl: Batterij aan tijd: %u

source: Charger fault
nl: Oplaad fout

source: Charging port plugged in
nl: Oplaad aansluiting ingestoken

source: Error talking to power bank
nl: Probleem bij communicatie met power bank

source: Failed forking into the background
nl: Fout bij omschakelen naar achtergrond proces

source: Failed opening %s
nl: Kan %s niet openen

source: HV output current: %f
nl: HV uitvoer stroom: %f

source: HV output on
nl: HV uitvoer aan

source: HV output voltage: %f
nl: HV uitvoer voltage: %f

source: Index out of range
nl: Index buiten bereik

source: JSON output for -m dump
nl: JSON indeling uitvoer bij -m dump

source: Name too long
nl: Naam is te lang

source: Parameter missing
nl: Er ontbreekt een parameter

source: Poll on powerbank failed
nl: Uitlezen powerbank mislukt

source: Powerbank went silent
nl: Powerbank viel stil

source: Problem receiving state from powerbank
nl: Probleem bij ontvangen toestand van powerbank

source: Problem sending command to powerbank
nl: Probleem bij zenden commando naar powerbank

source: Statemachine is in auto send mode
nl: Toestandsmachine staat in automatisch verzenden mode

source: USB output current: %f
nl: USB uitvoer stroom: %f

source: USB output on
nl: USB uitvoer staat aan

source: Virtual serial port connected
nl: Virtuele seriele port is aangesloten

source: Warnings enabled
nl: Waarschuwing aan

source: battery voltage: %f
nl: batterij voltage: %f

source: charging current: %f
nl: oplaad stroom: %f

source: command to use to power down system (see -D and -m ups)
nl: welk commando te gebruiken om het systeem uit te zetten (zie -D en -m ups)

source: configuring bq24295
nl: configureren bq24295

source: dump format
nl: indeling dump uitvoer

source: fork into the background (become daemon)
nl: draai verder in de achtergrond

source: get this help
nl: geeft deze help

source: get version of this program
nl: toon versie-nummer van dit programma

source: how long to wait before shutdown after power loss
nl: hoe lang te wachten voordat het systeem uitgezet wordt nadat de stroombron verwijderd is

source: index (if any) for the command chosen
nl: index (indien van toepassing) voor het gekozen commando

source: main
nl: algemeen

source: mode of this tool: ups, dump, set-name, set-bq24295, set-usb, set-hv
nl: mode van dit programma: ups, dump, set-name, set-bq24295, set-usb, set-hv

source: name: %s
nl: naam: %s

source: parameter (if any) for the command chosen
nl: parameter (indien van toepassing) voor het gekozen commando

source: tcgetattr failed: did you select a powerbank serial port?
nl: tcgetattr faalde: heb je een powerbank seriele poort gekozen?

source: tcsetattr failed: problem talking to serial port
nl: tcsetattr faalde: probleem bij communicatie

source: temperature: %f
nl: temperatuur: %f

source: | battery voltage, * charging current, + hv output current,
nl: | batterij voltage, * oplaad stroom, + hv uitvoer stroom,
